[
  {
    "id": "doc-fe815ecd-3f8b-446f-8556-723160ec407d_chunk_0",
    "metadata": {
      "chunk_index": 0,
      "document_id": "doc-fe815ecd-3f8b-446f-8556-723160ec407d",
      "user_id": "d181c97b-a18c-4db0-82e6-1fa136ff17d5",
      "file_type": "application/pdf",
      "processed_at": "2025-10-08T00:37:33.024637",
      "original_filename": "CW3.pdf",
      "content_type": "application/pdf",
      "upload_date": "2025-10-08T00:37:32.325447",
      "conversation_id": "246dc160-9f43-4571-8840-d84470c942e1"
    },
    "text": " \nThis document is intended for Coventry University Group students for their own use in completing their \nassessed work for this module . It must  not be passed to third parties or posted on any website.  Page 1 of 9 \n  \nStudent Assignment Brief\n \n \nThis document is intended for Coventry University Group students for their own use in \ncompleting their assessed work for this module. It must  not be passed to third parties or \nposted on any website.  If you require this document in an alternative format, please contact \nyour Module Leader.  \n \n \nContents:  \n• Assignment Information  \n• Assignment Task  \n• Marking and Feedback  \n• Assessed Module Learning Outcomes  \n• Assignment Support and Academic Integrity  \n• Assessment Marking Criteria  \nThe work you submit for this assignment must be your own independent work, or in the case of a \ngroup assignment your own groups’ work. More information is available in the ‘ Assignment Task ’ \nsection of this assignment brief.  \n \nAssignment Information  \nModule Name: Computing Individual Research Project  \nModule Code: 7151CEM  \nAssignment Title: Project Report  \nAssignment Due: Thursday 14th August 2025 by 18:00pm UK time   \nFor assessments that are submitted through Turnitin, the University allows a 24 -hour grace period for \nreceipt of submission. Therefore, submission will only be accepted up until Friday 15th August 2025  by \n18.00hrs. This should NOT be viewed as extra time to complete the assessment but is provided to \nallow for any unforeseen technical issues that may occur around the submission deadline, especially \nwhen Turnitin is handling large numbers of submissions.   \nPlease note that this assessment is eligible for an extension .  \n  \nAssignment Credit: 40 credits  \nWord Count (or equivalent ): 15000 words +10%; i.e, 16500 words  \n\n\n \nThis document is intended for Coventry University Group students for their own use in completing their \nassessed work for this module . It must  not be passed to third parties or posted on any website.  Page 2 of 9 \n You should state your word count at the end of written work. If you exceed the word limit by more than \n10% (i.e. if you exceed 16500 words , then you r work will only be read up to the allocated limit.   \n \nAssignment Type:  \nPercentage Grade (Applied Core Assessment ). You will be provided with an overall grade between \n0% and 100%. You have one opportunity to pass the assignment at or above 40%.   \n \nAssignment Task  \nThe project is intended to provide you with the opportunity to demonstrate competence in applying the \nconcepts and skills acquired during the taught part of the course. You will apply a level of intellectual \nrigor which is commensurate with the standard of  your Masters level programme of study. The project \nmay be a solution to a practical industry problem/requirement or focus on a research topic. Projects \ncan be either practical problems undertaken for a real client or a research project, normally \nundertake n in conjunction with a research group in the faculty. In either case you will be applying and \nextending skills and knowledge acquired in the taught elements of the course.   \nYou are asked to produce a comprehensive, thorough and professional report, documenting the \nconduct, approach and outcomes of the project, further supported with a critical review of the project \nconduct and management.   \nThe project should include the following:   \n1. Research methods and literature review with discussion and analysis (LO2 & LO3) 30%   \n2. Tools and Techniques used within chosen specialism to help with the construction of chosen \nsolutions and construction of chosen solution. (LO1) 40%   \n3. Project management and critical evaluation of performance and conduct. (LO4) 20%   \n4. The evaluation of any legal, social and ethical issues relating to research and project work. \n(LO5) 10%   \nEthics   \nThe university has a policy that looks at the ethical considerations of undertaking research work. If \nyou are undertaking any primary research involving human participants, e.g. using questionnaires or \nundertaking interviews, you will need to identify the implications of the research work and provide \nappropriate information to anyone collaborating in your data collection.   \n  \nProject Report Template   \nYou are advised to use the template provided on Aula when writing up your final project.   \n \n \n \n\n \nThis document is intended for Coventry University Group students for their own use in completing their \nassessed work for this module . It must  not be passed to third parties or posted on any website.  Page 3 of 9 \n Generative AI  \nThis assignment is in the amber category for use of AI. This means that you can use AI to assist your \nwork as outlined below:   \n \nTool  Use  \nMicrosoft Co-pilot / ChatGPT   Planning and management or your \npresentation. Summarising and consolidating \nnotes and sources as part of background \nresearch, translating small sections of your \nwritten or recorded work into another \nlanguage. Presenting data in formats such as \ngraphs, char ts, tables, and other similar \nactivities   \nAdobe Express   Creation of custom illustrations or conceptual \nimages, icons, shapes, charts, typography. \nImage background removal, resize and \ncropping, image enhancement. Visually \nappealing layouts for slides. Feedback on \ndesigns   \n \nSubmission Instructions:  \nYou are required to submit your project as an MS Word file via Turnitin on the 7150CEM Aula page.   \nRemember that submission may take time to complete, so aim to submit several hours before the \ndeadline. If you experience any technical problems when trying to submit your work, please consult \nAula help via the question mark link. If these problems are exp erienced at the time of the submission \ndeadline and cannot be quickly resolved, please capture screenshots as evidence and email these and \nyour completed assessment to the module leader immediately. If using AI to support your work, you \nmust cite and refer ence any information correctly (see  LibGuides ) and you must provide details of how \nit was used as outlined below.    \nInsert these details on a new page after the reference list under the subheading: Use of Artificial \nIntelligence. You must state the following:   \n• AI Tool used   \n• Dates of use   \n• Details of tasks used for   \n• Prompts used   \nAcademic staff will not be responsible for removing submissions that are made in error. Therefore, \nplease take care in checking your submission before uploading to the final assessment submission link. \nYou may submit multiple times to the final assessment link but do remember that obtaining a similarity \nreport may take up to 24 hours and this should not be attempted close to the deadline.  You may also \nutilise the draft link in the community pages for checking your similarity scores prior to the deadline.  \n ",
    "embedding_size": 1536
  },
  {
    "id": "doc-fe815ecd-3f8b-446f-8556-723160ec407d_chunk_1",
    "metadata": {
      "chunk_index": 1,
      "document_id": "doc-fe815ecd-3f8b-446f-8556-723160ec407d",
      "user_id": "d181c97b-a18c-4db0-82e6-1fa136ff17d5",
      "file_type": "application/pdf",
      "processed_at": "2025-10-08T00:37:33.024637",
      "original_filename": "CW3.pdf",
      "content_type": "application/pdf",
      "upload_date": "2025-10-08T00:37:32.325447",
      "conversation_id": "246dc160-9f43-4571-8840-d84470c942e1"
    },
    "text": " \nThis document is intended for Coventry University Group students for their own use in completing their \nassessed work for this module . It must  not be passed to third parties or posted on any website.  Page 4 of 9 \n If you experience any technical problems when trying to submit your work, please consult Aula help via \nthe question mark link.  If these problems are experienced at the time of the submission deadline and \ncannot be quickly resolved, please capture screenshots as evidence and email these and your \ncompleted assessment to the module leader as soon as possible . Whilst this cannot be marked it could \nbe used as evidence that you’ve gained no time advantage on your work should this be needed for an \nappeal.  \n \nMarking and Feedback  \nHow will my assignment be marked?  \nYour assignment will be marked by the  allocated supervisor s \nHow will I receive my grades and feedback?  \nProvisional marks  will be released once internally moderated  \nFeedback will be provided by the allocated supervisors module team alongside grades release  \nFeedback comments can be accessed by clicking on your submission in Turnitin and selecting the \ncomments icon. The completed marks rubric can be accessed through the rubric icon.  \nYour provisional marks and feedback should be available within 2 weeks (10 working days) . \nWhat will I be marked against?  \nDetails of the marking criteria  for this task can be found at the bottom of this assignment brief .  \n \nAssessed Module Learning Outcomes  \nThe Learning Outcomes for this module align to the marking criteria  which can be found at the end of \nthis brief. Ensure you understand the marking criteria  to ensure successful achievement of the \nassessment task . The following module learning outcomes are assessed in this task:  \n \n1. Propose and construct innovative solutions to the research problems by applying appropriate \nmethodology, tools and techniques within a chosen specialism and critically evaluate problem \nsolving processes.  \n2. Critically review current information resources r elevant to a particular problem domain and \njustify the proposed solutions.  \n3. Apply appropriate research strategies, analyse research findings to draw conclusions and \ncommunicate effectively in verbal and written presentation.  \n4. Apply project management t echniques to undertaking a significant piece of individual work.  \n5. Critically evaluate any professional, legal, social and ethical issues relating to the project.  \n \n\n \nThis document is intended for Coventry University Group students for their own use in completing their \nassessed work for this module . It must  not be passed to third parties or posted on any website.  Page 5 of 9 \n Assignment Support and Academic Integrity  \nIf you have any questions about this assignment please see the Student Guidance on Coursework  for \nmore information.  \nSpelling, Punctuation, and Grammar:  \nYou are expected to use effective, accurate, and appropriate language within this assessment task.  \n \nAcademic Integrity:  \nThe work you submit must be your own, or in the case of groupwork, that of your group. All sources of \ninformation need to be acknowledged and attributed; therefore, you must provide references for all \nsources of information and acknowledge any tools used i n the production of your work, including \nArtificial Intelligence (AI).  We use detection software and make routine checks for evidence of \nacademic misconduct.  \nIt is your responsibility to keep a record of how your thinking has developed as you progress through \nto submission. Appropriate evidence could include: version controlled documents, developmental \nsketchbooks, or journals. This evidence can be called upon if we suspect academic misconduct.  \nIf using Artificial Intelligence (AI) tools in the development of your assignment, you must reference \nwhich tools you have used and for what purposes you have used them. This information must be \nacknowledged in your final submission.  \nDefinitions of academic misconduct , including plagiarism, self -plagiarism, and collusion  can be \nfound  on the Student Portal . All cases of suspected academic misconduct are referred for \ninvestigation, the outcomes of which can have profound consequences to your studies.  For more \ninformation on academic integrity please visit the  Academic and Research Integrity  section of the \nStudent Portal.  \nSupport for Students with Disabilities or Additional Needs:  \nIf you have a disability, long -term health condition, specific learning differenc e, mental health \ndiagnosis or  symptoms and have discussed your support needs with health and wellbeing you may be  \nable to access support that will help with your studies.  \nIf you feel you may benefit from additional support, but have not disclosed a disability to  the \nUniversity, or have disclosed but are yet to discuss your support needs it is important  to let us know \nso we can provide the right support for your circumstances. Visit the Student Portal  to find out more.  \nUnable to Submit on Time?  \nThe University wants you to do your best. However, we know that sometimes events happen which \nmean that you cannot submit your assessment by the deadline or sit a scheduled exam. If you think \nthis might be the case, guidance on understanding what counts as  an extenuating circumstance, and \nhow to apply is  available on the Student Portal.\n\n \nThis document is intended for Coventry University Group students for their own use in completing \ntheir assessed work for this module. It should not be passed to third parties or posted on any website.  Page 6 of 9 \n  \n \nAdministration of Assessment  \nModule Leader Name : Leona Brayne and Omid Chatrabgoun  \nModule Leader Email : ae2443@coventry.ac.uk , ad8337@coventry.ac.uk  \nAssignment Category : Written  \nAttempt Type : Standard  \nComponent Code: Cw3",
    "embedding_size": 1536
  },
  {
    "id": "doc-fe815ecd-3f8b-446f-8556-723160ec407d_chunk_2",
    "metadata": {
      "chunk_index": 2,
      "document_id": "doc-fe815ecd-3f8b-446f-8556-723160ec407d",
      "user_id": "d181c97b-a18c-4db0-82e6-1fa136ff17d5",
      "file_type": "application/pdf",
      "processed_at": "2025-10-08T00:37:33.024637",
      "original_filename": "CW3.pdf",
      "content_type": "application/pdf",
      "upload_date": "2025-10-08T00:37:32.325447",
      "conversation_id": "246dc160-9f43-4571-8840-d84470c942e1"
    },
    "text": " \nThis document is intended for Coventry University Group students for their own use in completing their \nassessed work for this module. It should not be passed to third parties or posted on any website.  Page 7 of 9 \n Assessment Marking Criteria  \n \nMarking Rubric:  \n  Research methods and literature \nreview with discussion and analysis  \nWeighting: 30%  Tools and Techniques and \nconstruction of chosen solutions \nWeighting: 40%  Project management and \ncritical evaluation of \nperformance and \nconduct  \nWeighting: 20%  Evaluation of any legal, \nsocial and ethical issues  \nWeighting: 10%  \nOutstanding \n80, \n82, 85, 88, \n90, 92, 95, \n98, 100  Research approach is conceptually \ngrounded and critically justified using a \nwide range of recent, relevant, and high -\nquality sources. Methodological \ndecisions are underpinned by critical \nengagement with the literature and \ntheoretical frameworks. Detailed, \ntransparent steps are presented that \nwould allow replication. Demonstrates \nindependent judgement and original \ninsight into research design and \nmethodological limitations.  Solution is fully implemented \nApplying a coherent, innovative, \nand well -justified solution with \nappropriate tools and techniques. \nTechnical decisions are critically \nevaluated and clearly situated \nwithin disciplinary best practice. \nOutcomes are interpreted and \nclearly linked to project goals.  Project is managed with \nautonomy and rigour. \nEvaluation of decisions is \ninsightful and reflects on \ncomplexity, change, and \nconstraints. Demonstrates \ncritical judgement and \nplanning adaptation . Demonstrates deep and \ncritical understanding of \nlegal, ethical, and social \nframeworks. Evaluates \nimplications with reference \nto professional standards \nand complex contexts.  \nExcellent  \n70, 72, 75, \n78 Research methods are well -justified and \nappropriate, with clear rationale \ngrounded in recent and relevant \nacademic literature. The literature review \ncritically evaluates contrasting sources to \nsupport method selection and project \ndirection. Methodological steps are \nclearly documented and generally \nreplicable. Demonstrates consistent \nawareness of research complexity.  Solution is implemented effectively \napplying and justifying  appropriate \ntools and techniques. Most \ndecisions are explained and \ngenerally linked to the problem \ncontext. Interpretation of outcomes \nis present.  Planning is structured and \ntracked. Evaluates project \ndecisions with clarity and \nsome critical insight into \nprocess and adjustments.  Identifies relevant legal, \nethical, and social issues \nand evaluates implications. \nApplies appropriate \nframeworks and shows \nawareness of professional \nresponsibilities.  \nVery good  The research approach is appropriate \nand supported by a relevant literature Applies appropriate tools with some \ncritical justification. Evidence of Project planning and \nevaluation are well Discusses relevant issues \nwith some evaluation. \n\n \nThis document is intended for Coventry University Group students for their own use in completing their \nassessed work for this module. It should not be passed to third parties or posted on any website.  Page 8 of 9 \n 60, 62, 65, \n68 base. Some critical engagement and \nsynthesis are evident, though analysis \nmay be limited to individual sources. \nMethods are described with reasonable \nclarity and most steps are replicable. \nJustification is present but could be \nbetter developed or more tigh tly linked to \nliterature.  sound technical judgement, but \ncritical analysis of decisions may be \nunderdeveloped and  links to the \noverall goals may be partial.  evidenced. Reflection \naddresses key decisions \nbut may not fully explore \nprocess complexity.  Application of frameworks \nmay be uneven or \ndescriptive in parts.  \nGood  \n50, 52, 55, \n58 Research approach is broadly \nappropriate, but justification is limited or \ngeneralised. Literature review includes \nrelevant sources, but is largely \ndescriptive or lacks depth in analysis. \nLinks between literature and method \nselection may be implied rather th an \nexplicit. Methodological steps are \noutlined but may lack clarity or \ncompleteness.  A basic solution is presented using \nsome appropriate tools. \nJustification of approach is limited. \nTechnical interpretation may be \ndescriptive with minimal analysis.  Limited evidence of \nstructured planning. \nEvaluation is mostly \ndescriptive with minimal \ncritical reflection on \nconduct.  Descriptive overview of \nlegal, social, or ethical \nissues. Limited evaluation \nor justification.  \nAcceptable  \n40, 42, 45, \n48 Provides a basic overview of research \nmethods and some literature. Sources \nmay be dated, poorly integrated, or only \nloosely connected to the rationale. \nReview is descriptive and lacks critical \nanalysis. Method description may be \nunderdeveloped or unclear, with limited \nreplicability.  A partial or underdeveloped \nsolution is provided. Tools and \ntechniques used are limited or not \nfully appropriate. Explanations lack \nclarity or relevance.  Project planning and \nevaluation are basic or \nincomplete. Reflection \nlacks depth or relevance.  Superficial or minimal \ndiscussion of relevant \nissues. Limited awareness \nof impact.  \nFail (30, 35)  Attempt made to present research and \nliterature, but  lacks structure and critical \nengagement. Few sources are used, with \nlimited relevance or justification. Methods \nare poorly described, with little rationale \nor transparency. The approach lacks \ncoherence and academic foundation.  Minimal or unclear use of relevant \ntools. Solution is incomplete or \nlacks coherence. Explanations are \nlargely absent or incorrect.  Minimal evidence of \nstructured planning or \nevaluation. Little \nconnection made between \nactions and outcomes.  Brief mention of issues \nwith no meaningful \ndiscussion or application.  \n\n \nThis document is intended for Coventry University Group students for their own use in completing their \nassessed work for this module. It should not be passed to third parties or posted on any website.  Page 9 of 9 \n Fail (0, 10, \n20) No coherent research approach or \nrelevant literature. Demonstrates no \nunderstanding of research design or \nsource evaluation. Method and literature \nreview are absent, irrelevant, or \ndisconnected from the project aim.  Little or no application of tools or \ntechniques relevant to the \nspecialism. No recognisable \nsolution developed.  No clear evidence of \nplanning or evaluation. \nReflection absent.  No evidence of \nconsideration of legal, \nsocial, or ethical issues.  \n \n \n \n\n",
    "embedding_size": 1536
  }
]